<h2>Quiz 1 : Pivoting and Melting</h2>

Jelaskan itu pivoting dan melting data

jawaban : Pivoting adalah suatu pengubahan bentuk data dengan memutar data yang terletak di baris menjadi di column.

Melting adalah ‘unpivoting’, melting mengubah suatu data dengan memutar dari yang tadinya berada di posisi column menjadi di posisi row.

<h2>Quiz 2 : Data structure Comprehension</h2>

Data yang rapi adalah :
1. Setiap row menunjukan suatu unit observasi
2. Setiap column merupakan suatu unit variable

Bagaimana pun, dalam menentukan unit observasi itu tergantung dari kasus yang di hadapi. sebagai seorang data scientist pasti akan menemukan berbagai bentuk struktur data. adalah sangat penting bagi seorang data scientist untuk dapat memahami dan menjelaskan setiap struktur data. Kemampuan memahami hubungan antara index baris, column dan isi data adalah kunci untuk memahami informasi apa yang data sedang beritahukan kepada kita.

Di bawah ini terdapat 2 data yang berisi sama, tetapi memiliki struktur yang berbeda. Jelaskan perbedaan dari 2 struktur data tersebut

![alt text](https://drive.google.com/uc?id=1h13CDPzIjc-2XyRcyu-p1fet0Ep1gdMA)

![alt text](https://drive.google.com/uc?id=12ji98ell5tNcCxeBzl4v8qqBtFMgDSr0)

Tabel 1 menggambarkan struktur data yang rapi atau dapat dikatakan efektif dan efisien, mulai dari tidak adanya redudansi data serta baris dan kolom saling berhubungan

sedangkan Tabel 2 menggambarkan struktur data yang kurang rapi karena terlihat banyak yang redudansi serta sulit untuk menemukan informasi yang akan dicari

<h2>Quiz 3 : Reshaping Data 1</h2>

In [0]:
import pandas as pd
import random

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1', 'UTS2', 'UAS2']*3,
    'Mata Pelajaran' : ['Fisika']*4 + ['Matematika']*4+['Statistika']*4,
    'Rata2 Waktu Belajar (menit)' : [random.choice(range(200, 800)) for i in range(12)],
    'Rata2 Nilai Ujian' : [random.choice(range(40, 100)) for i in range(12)] 
}
df = pd.DataFrame(data)
df

   Tipe Ujian Mata Pelajaran  Rata2 Waktu Belajar (menit)  Rata2 Nilai Ujian
0        UTS1         Fisika                          669                 87
1        UAS1         Fisika                          466                 44
2        UTS2         Fisika                          696                 49
3        UAS2         Fisika                          419                 78
4        UTS1     Matematika                          738                 71
5        UAS1     Matematika                          607                 43
6        UTS2     Matematika                          453                 72
7        UAS2     Matematika                          704                 51
8        UTS1     Statistika                          233                 56
9        UAS1     Statistika                          332                 62
10       UTS2     Statistika                          652                 80
11       UAS2     Statistika                          765                 76

Perhatikan data di atas, kemudian ubahlah bentuknya agar sesuai yang di harapkan.

In [0]:
df.pivot_table(index='Tipe Ujian', columns=['Mata Pelajaran'], values=['Rata2 Nilai Ujian','Rata2 Waktu Belajar (menit)'])

               Rata2 Nilai Ujian             ... Rata2 Waktu Belajar (menit)
Mata Pelajaran            Fisika Matematika  ...                  Matematika Statistika
Tipe Ujian                                   ...
UAS1                          44         43  ...                         607        332
UAS2                          78         51  ...                         704        765
UTS1                          87         71  ...                         738        233
UTS2                          49         72  ...                         453        652

[4 rows x 6 columns]

Expected Result :

![alt text](https://drive.google.com/uc?id=1XufsfqZe7-XZLsb92SpATexy-QRZE0ow)

<h2>Quiz 4 : Reshaping Data 2</h2>

In [0]:
import pandas as pd

data = {
    'Hari' : ['Sabtu', 'Minggu'],
    'Kebun Binatang' : [271, 399],
    'Dufan' : [501, 700],
    'Disney' : [1000, 1001],
    'Bali' : [900, 803]
}
df = pd.DataFrame(data).set_index('Hari')
df

        Kebun Binatang  Dufan  Disney  Bali
Hari
Sabtu              271    501    1000   900
Minggu             399    700    1001   803

diatas adalah data tentang jumlah pengunjung di berbagai tempat hiburan, ubahlah struktur data tersebut sehingga sesuai dengan hasil yang diharapkan.

In [0]:
df = df.reset_index()

In [0]:
df.melt(id_vars=['Hari'], value_vars=['Kebun Binatang','Dufan','Disney','Bali'], var_name='Tempat Hiburan', value_name='Pengunjung')

     Hari  Tempat Hiburan  Pengunjung
0   Sabtu  Kebun Binatang         271
1  Minggu  Kebun Binatang         399
2   Sabtu           Dufan         501
3  Minggu           Dufan         700
4   Sabtu          Disney        1000
5  Minggu          Disney        1001
6   Sabtu            Bali         900
7  Minggu            Bali         803

Expected Result :

![alt text](https://drive.google.com/uc?id=159mIqcyfeD30EEcyZmmkovORa6cZDLtn)

<h2>Quiz 5 : Pivoting and Aggregating</h2>

In [0]:
import pandas as pd

data = {
    'Tipe Ujian' : ['UTS1', 'UAS1']*3,
    'Mata Pelajaran' :['Statistika', 'Fisika', 'Fisika', 'Statistika', 'Fisika', 'Statistika'],
    'Jumlah Peserta' : [14, 17, 12, 16, 14, 13]
}
df = pd.DataFrame(data).set_index('Tipe Ujian')
df

           Mata Pelajaran  Jumlah Peserta
Tipe Ujian
UTS1           Statistika              14
UAS1               Fisika              17
UTS1               Fisika              12
UAS1           Statistika              16
UTS1               Fisika              14
UAS1           Statistika              13

Perhatikan bahwa data jumlah peserta ujian untuk suatu tipe ujian dan mata pelajaran tertentu ada yang duplikat, ubahlah struktur data tersebut dan lakukan aggregasi berjenis jumlah sehingga sesuai dengan hasil yang di harapkan

Expected Result :

![alt text](https://drive.google.com/uc?id=1emoz7orYR-0mCHffvAgM8j-V1P6yVHf0)

In [0]:
df.pivot_table(index='Tipe Ujian', columns='Mata Pelajaran', values='Jumlah Peserta', aggfunc='sum')

Mata Pelajaran  Fisika  Statistika
Tipe Ujian
UAS1                17          29
UTS1                26          14